def calc(s):
    nums = {
        "один": 1,
        "два": 2,
        "три": 3,
        "четыре": 4,
        "пять": 5,
        "шесть": 6, 
        "семь": 7,
        "восемь": 8,
        "девять": 9,
        "десять": 10,
        "одиннадцать": 11,
        "двенадцать": 12,
        "тринадцать": 13,
        "четырнадцать": 14,
        "пятнадцать": 15,
        "шестнадцать": 16,
        "семнадцать": 17,
        "восемнадцать": 18,
        "девятнадцать": 19,
        "двадцать": 20,
        "тридцать": 30,
        "сорок": 40,
        "пятьдесят": 50,
        "шестьдесят": 60,
        "семьдесят": 70,
        "восемьдесят": 80,
        "девяносто": 90
    }
    s = s.split()
    dos = {"плюс", "минус", "умножить"}
    do_oper = {
    'плюс': lambda a, b: a + b,
    'минус': lambda a, b: a - b,
    'умножить': lambda a, b: a * b
    }
    sz = len(s)
    do_ind = 0
    for i in range (0, sz):
        if (s[i] in dos):
            do_ind = i
    a = 0
    b = 0
    for i in range (0, do_ind):
        a = a + nums[s[i]]
    for i in range (do_ind + 1, sz):
        b = b + nums[s[i]]
    res = do_oper[s[do_ind]]
    return res(a, b)
    
print (calc("тринадцать умножить тридцать три"))